In [4]:
import pandas as pd

In [6]:
grades = pd.Series ([87,100,94])
grades

0     87
1    100
2     94
dtype: int64

In [7]:
pd.Series (98.6,range(3))

0    98.6
1    98.6
2    98.6
dtype: float64

In [8]:
grades[0]

87

In [9]:
grades.count()

3

In [10]:
grades.mean()

93.66666666666667

# use all the descriptive statistics at once

In [11]:
grades.describe()

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

# series with custom indecies (custom indexes) need to be immutable - int,str,

In [14]:
custom = pd.Series([8,7,3], index = ['Ruby','Joy','Pascal'])
custom

Ruby      8
Joy       7
Pascal    3
dtype: int64

In [13]:
#using dictionary 
grades = pd.Series({'Wally':87,'Eva': 100,'Sam':94})
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [15]:
#to index my new custom Series
custom.Ruby

8

In [16]:
grades.values

array([ 87, 100,  94], dtype=int64)

In [17]:
hardware = pd.Series(['Hammer','Saw','Wrench'])
hardware

0    Hammer
1       Saw
2    Wrench
dtype: object

In [18]:
#accesing all the capabilities of strings in python and more
hardware.str.contains('a')

0     True
1     True
2    False
dtype: bool

In [19]:
hardware.str.upper()

0    HAMMER
1       SAW
2    WRENCH
dtype: object

_vid 170_ self check

In [35]:
import numpy as np
temperatures = np.random.randint(60,101,5)
temperatures
temperatures_pd= pd.Series(temperatures)
temperatures_pd
print(temperatures_pd)
temperatures_pd.min()
temperatures_pd.describe()

0    98
1    86
2    62
3    93
4    62
dtype: int32

count     5.000000
mean     80.200000
std      17.152259
min      62.000000
25%      62.000000
50%      86.000000
75%      93.000000
max      98.000000
dtype: float64

# Data Frame

In [38]:
grades_dict = {'Wally':[87,96,70],'Eva':[100,87,90],'Sam':[94,77,90],'Katie':[100,81,82],'Bob':[83,65,85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [39]:
grades.index = ['Test1','Test2','Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

# accessing Data Frames Columns

In [40]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [42]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

# accessing Data Frames Rows

In [43]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [44]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

# slicing Data Frame

In [45]:
#icluding Test3
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [46]:
# using iloc its upper value exclusive 
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [47]:
#you can pass it a list to get the rows you need 
grades.loc[['Test1','Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [48]:
grades.iloc[[1,2]]

       Wally  Eva  Sam  Katie  Bob
Test2     96   87   77     81   65
Test3     70   90   90     82   85

# subsets of rows and columns

In [50]:
grades.loc['Test1':'Test2',['Eva','Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [51]:
grades.iloc[[0,2],0:3]

       Wally  Eva  Sam
Test1     87  100   94
Test3     70   90   90

# Bollean Indexing

In [52]:
grades[grades >= 90]

       Wally    Eva   Sam  Katie  Bob
Test1    NaN  100.0  94.0  100.0  NaN
Test2   96.0    NaN   NaN    NaN  NaN
Test3    NaN   90.0  90.0    NaN  NaN

In [53]:
grades[( grades >= 80) & ( grades < 90 )]

       Wally   Eva  Sam  Katie   Bob
Test1   87.0   NaN  NaN    NaN  83.0
Test2    NaN  87.0  NaN   81.0   NaN
Test3    NaN   NaN  NaN   82.0  85.0

# Accessing specific DataFrame cell by row and column

In [54]:
grades.at [ 'Test2','Eva']

87

In [58]:
print(grades.iat[2,0])
grades.iat[2,0] = 87
grades.iat[2,0]

70

87

In [57]:
grades.at [ 'Test2','Eva'] = 100
grades.at [ 'Test2','Eva']

100

# Descriptive Statistics on DataFrame

In [59]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96  100   77     81   65
Test3     87   90   90     82   85

In [61]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   90.000000   96.666667  87.000000   87.666667  77.666667
std     5.196152    5.773503   8.888194   10.692677  11.015141
min    87.000000   90.000000  77.000000   81.000000  65.000000
25%    87.000000   95.000000  83.500000   81.500000  74.000000
50%    87.000000  100.000000  90.000000   82.000000  83.000000
75%    91.500000  100.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [62]:
pd.set_option('precision',2)
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count    3.0    3.00   3.00    3.00   3.00
mean    90.0   96.67  87.00   87.67  77.67
std      5.2    5.77   8.89   10.69  11.02
min     87.0   90.00  77.00   81.00  65.00
25%     87.0   95.00  83.50   81.50  74.00
50%     87.0  100.00  90.00   82.00  83.00
75%     91.5  100.00  92.00   91.00  84.00
max     96.0  100.00  94.00  100.00  85.00

In [63]:
grades.mean()

Wally    90.00
Eva      96.67
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

# Transposing DataFrame with the T attribute

In [64]:
grades.T

       Test1  Test2  Test3
Wally     87     96     87
Eva      100    100     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [65]:
#descriptive statistics on the test by test basis
grades.T.describe()

        Test1   Test2  Test3
count    5.00    5.00   5.00
mean    92.80   83.80  86.80
std      7.66   14.31   3.42
min     83.00   65.00  82.00
25%     87.00   77.00  85.00
50%     94.00   81.00  87.00
75%    100.00   96.00  90.00
max    100.00  100.00  90.00

In [66]:
grades.T.mean()

Test1    92.8
Test2    83.8
Test3    86.8
dtype: float64

# Sorting by Indeces

In [67]:
#sort by row as default
grades.sort_index(ascending = False)

       Wally  Eva  Sam  Katie  Bob
Test3     87   90   90     82   85
Test2     96  100   77     81   65
Test1     87  100   94    100   83

In [68]:
#column based sort -> need to specify axis
grades.sort_index(axis = 1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65  100     81   77     96
Test3   85   90     82   90     87

# Sorting by column values

In [69]:
#who performed best on the test
grades.sort_values(by='Test1',axis = 1 , ascending = False)

       Eva  Wally  Katie  Sam  Bob
Test1  100     87    100   94   83
Test2  100     96     81   77   65
Test3   90     87     82   90   85

In [70]:
# to get a better view we can transpose the data
grades.T.sort_values(by='Test1', ascending = False)

       Test1  Test2  Test3
Eva      100    100     90
Katie    100     81     82
Sam       94     77     90
Wally     87     96     87
Bob       83     65     85

In [71]:
#get just the Test1 results
grades.loc['Test1'].sort_values(ascending = False)

Katie    100
Eva      100
Sam       94
Wally     87
Bob       83
Name: Test1, dtype: int64

# Vid 182 Self Check

In [79]:
temps = {'Mon':[68,89],'Tue':[71,93],'Wed': [66,82],'Thu':[75,97],'Fri':[62,79]}
temperatures = pd.DataFrame(temps,index=['Low','High'])
temperatures

      Mon  Tue  Wed  Thu  Fri
Low    68   71   66   75   62
High   89   93   82   97   79

In [85]:
#all rows :, and specified columns
temperatures.loc [:,'Mon':'Wed']

      Mon  Tue  Wed
Low    68   71   66
High   89   93   82

In [86]:
temperatures.loc ['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fri    62
Name: Low, dtype: int64

In [87]:
pd.set_option('precision',2)
temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64

In [88]:
temperatures.mean(axis = 1 )

Low     68.4
High    88.0
dtype: float64